Merge branch 'main' of https://github.com/AssureCodeProject/AssureCode
